; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared0 - mode
	thermograph2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star5)
	(supports instrument9 thermograph2)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star2)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
)
(:goal (and
	(pointing satellite3 Phenomenon8)
	(have_image Planet6 infrared0)
	(have_image Star7 spectrograph1)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Planet11 thermograph3)
	(have_image Phenomenon12 infrared0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 spectrograph1)
))

)

; plan
1. (turn_to satellite3 star0 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star0)
   goals met: 0 of 10
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 10
3. (calibrate satellite3 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 10
4. (turn_to satellite3 planet9 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet9)
   goals met: 0 of 10
5. (take_image satellite3 planet9 instrument7 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 1 of 10
6. (turn_to satellite3 planet6 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet6)
   goals met: 1 of 10
7. (take_image satellite3 planet6 instrument7 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 2 of 10
8. (turn_to satellite3 planet11 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet11)
   goals met: 2 of 10
9. (take_image satellite3 planet11 instrument7 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 3 of 10
10. (turn_to satellite3 phenomenon12 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon12)
   goals met: 3 of 10
11. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 3 of 10
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
13. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 10
14. (take_image satellite3 phenomenon12 instrument7 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 4 of 10
15. (turn_to satellite0 phenomenon13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 5 of 10
17. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 5 of 10
18. (take_image satellite0 planet14 instrument0 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 10
19. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 6 of 10
20. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 10
21. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 7 of 10
22. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 8 of 10
23. (turn_to satellite3 phenomenon8 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon8)
   goals met: 9 of 10
24. (take_image satellite3 phenomenon8 instrument7 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 10 of 10
